Ran Plan for dir: `projects/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.harbor.helm_release.harbor will be created
+ resource "helm_release" "harbor" {
      + atomic                     = false
      + chart                      = "harbor"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "harbor"
      + namespace                  = "foundation"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.goharbor.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                harbor:
                  expose:
                    # Set how to expose the service. Set the type as "ingress", "clusterIP", "nodePort" or "loadBalancer"
                    # and fill the information in the corresponding section
                    type: loadBalancer
                    tls:
                      # Enable TLS or not.
                      # Delete the "ssl-redirect" annotations in "expose.ingress.annotations" when TLS is disabled and "expose.type" is "ingress"
                      # Note: if the "expose.type" is "ingress" and TLS is disabled,
                      # the port must be included in the command when pulling/pushing images.
                      # Refer to https://github.com/goharbor/harbor/issues/5291 for details.
                      enabled: false
                
                  # The external URL for Harbor core service. It is used to
                  # 1) populate the docker/helm commands showed on portal
                  # 2) populate the token service URL returned to docker client
                  #
                  # Format: protocol://domain[:port]. Usually:
                  # 1) if "expose.type" is "ingress", the "domain" should be
                  # the value of "expose.ingress.hosts.core"
                  # 2) if "expose.type" is "clusterIP", the "domain" should be
                  # the value of "expose.clusterIP.name"
                  # 3) if "expose.type" is "nodePort", the "domain" should be
                  # the IP address of k8s node
                  #
                  # If Harbor is deployed behind the proxy, set it as the URL of proxy
                  externalURL: http://core.harbor.domain
            EOT,
        ]
      + verify                     = false
      + version                    = "1.15.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d projects/dev
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://34.64.36.57:4141/lock?id=Goboolean%252Finfrastructure%252Fprojects%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d projects/dev
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```